# LightAndMaterialAccuracyMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings..::..LightAndMaterialAccuracyMode Property
RenderingQualitySettings Class See Also
---
A value that controls light and material accuracy mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public LightAndMaterialAccuracyMode LightAndMaterialAccuracyMode { get; set; }
```

Visual Basic
---
```text
Public Property LightAndMaterialAccuracyMode As LightAndMaterialAccuracyMode
	Get
	Set
```

Visual C++
---
```text
public:
property LightAndMaterialAccuracyMode LightAndMaterialAccuracyMode {
	LightAndMaterialAccuracyMode get ();
	void set (LightAndMaterialAccuracyMode value);
}
```

# Remarks
The method of the renderer engine dealing with materials and shadows.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace